Tekla Open API Reference for Tekla Structures 2025
Distance.Parse Method (String, IFormatProvider, Distance.UnitType)
 Parses a distance from a string representation using the given unit type and culture.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Distance Parse(
	string text,
	IFormatProvider formatProvider,
	Distance.UnitType unitType
)
Public Shared Function Parse (
	text As String,
	formatProvider As IFormatProvider,
	unitType As Distance.UnitType
) As Distance
Parameters
text
Type: System.String
The text to parse.
formatProvider
Type: System.IFormatProvider
The number format provider.
unitType
Type: Tekla.Structures.Datatype.Distance.UnitType
The unit type of the distance to parse. Determines the parsing process.
Return Value
Type: Distance
The representation of the specified distance.
Exceptions
Exception | Condition
FormatException | Thrown if the text does not represent a distance.
ArgumentException | Thrown if an invalid unit type is specified.
Examples
 This example shows how to specify a format provider and a unit type when parsing a Distance instance from a string.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
       public void Example1()
       {
           // We can override the current unit type to force the parsing to perform automatic unit conversion.
           // This will be parsed as 3.2 inches.
           Distance distanceInInches = Distance.Parse("3.2", CultureInfo.InvariantCulture, Distance.UnitType.Inch);
           // When using feet or inches as the distance unit, the fractional format is supported as well.
           // This will be parsed as 3/4 inches.
           Distance InchesInFractionalFormat = Distance.Parse("3/4", CultureInfo.InvariantCulture, Distance.UnitType.Inch);
       }
}
See Also
Reference
Distance Structure
Parse Overload
Tekla.Structures.Datatype Namespace